regions = {
    "서울특별시": {
        "강남구": ["논현동", "신사동", "압구정동", "청담동", "삼성동", "대치동", "역삼동", "도곡동", "개포동", "일원동", "수서동", "세곡동"],
        "강동구": ["강일동", "상일동", "명일동", "고덕동", "암사동", "천호동", "성내동", "둔촌동", "길동"],
        "강북구": ["미아동", "번동", "수유동", "우이동"],
        "강서구": ["염창동", "등촌동", "화곡동", "우장산동", "가양동", "방화동", "마곡동", "공항동"],
        "관악구": ["봉천동", "신림동"],
        "광진구": ["군자동", "구의동", "능동", "자양동", "중곡동", "화양동"],
        "구로구": ["구로동", "가리봉동", "고척동", "개봉동", "오류동", "천왕동", "항동"],
        "금천구": ["가산동", "독산동", "시흥동"],
        "노원구": ["상계동", "중계동", "하계동", "월계동"],
        "도봉구": ["도봉동", "방학동", "쌍문동", "창동"],
        "동대문구": ["신설동", "용두동", "제기동", "청량리동", "회기동", "휘경동", "이문동", "답십리동", "장안동"],
        "동작구": ["노량진동", "상도동", "사당동", "대방동", "신대방동"],
        "마포구": ["공덕동", "아현동", "도화동", "용강동", "대흥동", "염리동", "신수동", "서교동", "동교동", "합정동", "망원동", "연남동", "성산동", "상암동"],
        "서대문구": ["충정로동", "북아현동", "신촌동", "연희동", "홍제동", "홍은동", "남가좌동", "북가좌동"],
        "서초구": ["방배동", "서초동", "잠원동", "반포동", "양재동", "우면동", "내곡동"],
        "성동구": ["금호동", "옥수동", "왕십리동", "행당동", "응봉동", "하왕십리동", "성수동", "송정동"],
        "성북구": ["성북동", "삼선동", "동선동", "돈암동", "안암동", "보문동", "정릉동", "길음동", "종암동", "장위동", "석관동"],
        "송파구": ["잠실동", "신천동", "풍납동", "송파동", "석촌동", "삼전동", "가락동", "문정동", "장지동", "위례동"],
        "양천구": ["목동", "신정동", "신월동"],
        "영등포구": ["영등포동", "여의도동", "당산동", "문래동", "양평동", "신길동", "대림동"],
        "용산구": ["이촌동", "동자동", "한강로동", "용산동", "남영동", "원효로동", "효창동", "청파동", "서빙고동", "보광동", "후암동"],
        "은평구": ["불광동", "대조동", "응암동", "역촌동", "신사동", "증산동", "수색동", "녹번동", "구산동", "갈현동", "진관동"],
        "종로구": ["종로1가", "종로2가", "청운동", "신교동", "팔판동", "삼청동", "사직동", "구기동", "부암동", "평창동"],
        "중구": ["명동", "충무로동", "을지로동", "회현동", "필동", "장충동", "광희동", "황학동", "신당동"],
        "중랑구": ["면목동", "상봉동", "중화동", "묵동", "망우동", "신내동"]
    },
    "경기도": {
        "고양시": {
            "덕양구": ["행신동", "화정동", "주교동", "신도동"],
            "일산동구": ["백석동", "마두동", "정발산동"],
            "일산서구": ["주엽동", "대화동", "송포동"]
        },
        "과천시": ["중앙동", "문원동", "과천동"],
        "광명시": ["광명동", "철산동", "하안동", "소하동"],
        "광주시": ["경안동", "탄벌동", "송정동", "오포읍"],
        "구리시": ["교문동", "수택동", "갈매동"],
        "군포시": ["군포동", "산본동", "금정동"],
        "김포시": ["장기동", "사우동", "운양동", "양촌읍"],
        "남양주시": ["화도읍", "진접읍", "별내동", "다산동", "호평동", "평내동"],
        "동두천시": ["생연동", "지행동", "송내동"],
        "부천시": ["원미동", "소사동", "상동", "중동", "심곡동", "오정동"],
        "성남시": {
            "분당구": ["서현동", "정자동", "수내동", "이매동", "판교동"],
            "수정구": ["태평동", "복정동", "신흥동"],
            "중원구": ["상대원동", "성남동", "은행동"]
        },
        "수원시": {
            "장안구": ["영화동", "연무동", "율전동"],
            "권선구": ["권선동", "곡반정동", "세류동"],
            "팔달구": ["매산로동", "인계동", "우만동"],
            "영통구": ["영통동", "망포동", "태장동"]
        },
        "시흥시": ["정왕동", "군자동", "신천동", "은행동", "목감동"],
        "안산시": {
            "단원구": ["초지동", "고잔동", "와동"],
            "상록구": ["사동", "본오동", "이동"]
        },
        "안성시": ["공도읍", "금광면", "대덕면", "미양면"],
        "안양시": {
            "동안구": ["비산동", "평촌동", "관양동", "호계동"],
            "만안구": ["석수동", "안양동", "박달동"]
        },
        "양주시": ["회천동", "은현면", "남면", "양주동"],
        "여주시": ["세종대왕면", "가남읍", "점동면"],
        "연천군": ["연천읍", "청산면", "신서면"],
        "오산시": ["오산동", "외삼미동", "궐동"],
        "용인시": {
            "처인구": ["김량장동", "마평동", "역북동"],
            "기흥구": ["구갈동", "상갈동", "보정동"],
            "수지구": ["성복동", "풍덕천동", "죽전동"]
        },
        "의왕시": ["고천동", "오전동", "내손동", "청계동"],
        "의정부시": ["의정부동", "신곡동", "장암동"],
        "이천시": ["장호원읍", "마장면", "백사면"],
        "파주시": ["문산읍", "운정동", "금촌동", "조리읍"],
        "평택시": ["송탄동", "서정동", "안중읍", "팽성읍"],
        "포천시": ["신읍동", "소흘읍", "일동면"],
        "하남시": ["덕풍동", "미사동", "감이동"],
        "화성시": ["동탄동", "병점동", "봉담읍", "기배동"]
    }
}